app/Controllers/MenuTransaksiController.php

SELECT *
FROM `transaksi`
---
			public function delete($id)
			{
				$this->transaction->delete($id);

				return redirect('transaksi')->with('success','Data Berhasil Dihapus');